driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/FaultTest/caGreetService/test/testBCNormal2Way/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gre="http://xml.netbeans.org/schema/GreetBPLSchema">
  <soapenv:Body>
    <gre:inMsg>Johny</gre:inMsg>
  </soapenv:Body>
</soapenv:Envelope>